![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 11.3 Concatenating Along An Axis

First we import numpy and pandas:

In [1]:
import numpy as np
import pandas as pd

Now we create **two** series using the function **pd.Series()**:

In [2]:
ser1 = pd.Series([1,2,3], index = ['a', 'b', 'c'])
ser1

a    1
b    2
c    3
dtype: int64

In [3]:
ser2 = pd.Series([4,5,6], index = ['d', 'e','f'])
ser2

d    4
e    5
f    6
dtype: int64

We can concatenate these two series **along the rwo axis** using the function **concat()**:

In [4]:
pd.concat([ser1,ser2])

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

We can also concatenate these two series along the column axis by adding the argument **(axis = 1)**:

In [5]:
pd.concat([ser1,ser2], axis = 1)

     0    1
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  NaN  4.0
e  NaN  5.0
f  NaN  6.0

Lets create another series:

In [6]:
ser3 = pd.Series([7,8,9], index = ['a', 'b','g'])
ser3

a    7
b    8
g    9
dtype: int64

Concatenating series with common index **along the rows** will include duplicate index values:

In [7]:
pd.concat([ser1,ser3])

a    1
b    2
c    3
a    7
b    8
g    9
dtype: int64

Concatenating two series with different index along the column axis, will create missing values:

In [8]:
pd.concat([ser1,ser3], axis = 1)

     0    1
a  1.0  7.0
b  2.0  8.0
c  3.0  NaN
g  NaN  9.0

To include only the common index values when concatenating along columns, we add the argument **(join  = 'inner')**:

In [9]:
pd.concat([ser1,ser3], axis = 1, join = 'inner')

   0  1
a  1  7
b  2  8

For dataframes, lets first create these two dataframes, using the function **pd.DataFrame()**:

In [10]:
frame1 = pd.DataFrame({'states': ['California', 'Georgia', 'Florida', 'Arizona'],
                       'population': [40, 10, 21,7]})
frame1

       states  population
0  California          40
1     Georgia          10
2     Florida          21
3     Arizona           7

In [11]:
frame2 = pd.DataFrame({'states': ['Hawaii', 'Colorado', 'Indiana', 'Alaska', ],
                       'population': [1.5, 10.4, 5.7, 0.7]})
frame2

     states  population
0    Hawaii         1.5
1  Colorado        10.4
2   Indiana         5.7
3    Alaska         0.7

We can concatenate these two dataframes using the function **concat()**, by default concatenating is done along the rows:

In [12]:
pd.concat([frame1,frame2])

       states  population
0  California        40.0
1     Georgia        10.0
2     Florida        21.0
3     Arizona         7.0
0      Hawaii         1.5
1    Colorado        10.4
2     Indiana         5.7
3      Alaska         0.7

When concatenating along row, we create new index using the argument **ignore_index = True**:

In [13]:
pd.concat([frame1,frame2], ignore_index= True)

       states  population
0  California        40.0
1     Georgia        10.0
2     Florida        21.0
3     Arizona         7.0
4      Hawaii         1.5
5    Colorado        10.4
6     Indiana         5.7
7      Alaska         0.7

Lets now create these two dataframes:

In [14]:
frame3 = pd.DataFrame({'states': ['California', 'Georgia', 'Florida', 'Arizona'],
                       'population': [40, 10, 21,7]})
frame3

       states  population
0  California          40
1     Georgia          10
2     Florida          21
3     Arizona           7

In [15]:
frame4 = pd.DataFrame({'water': [23, 54, 12, 45 ], 'area': [113, 104, 36, 65]})
frame4

   water  area
0     23   113
1     54   104
2     12    36
3     45    65

We can concatenate these two dataframe along the **column axis** by using the argument **(axis = 1)**

In [16]:
pd.concat([frame3,frame4], axis = 1)

       states  population  water  area
0  California          40     23   113
1     Georgia          10     54   104
2     Florida          21     12    36
3     Arizona           7     45    65

***

<h1 align="center">Thank You</h1> 

***